Revit 2027 API
SpecTypeId.PipingRoughness Property
 Roughness, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingRoughness { get; }
Public Shared ReadOnly Property PipingRoughness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingRoughness {
	ForgeTypeId^ get ();
}
static member PipingRoughness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace